app/controllers/api/v1/users_controller.rb

  def create
    user = User.create(user_params)
---
INSERT INTO "users" ("first_name", "last_name", "encrypted_ssn", "encrypted_ssn_iv", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def index
    render json: UserSerializer.new(User.all)
---
SELECT "users".* FROM "users"